11/data/attachments/d9ae29592a548d29.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_9ad8fb8a-70f3-494a-a64f-14b965e2ce65</nif:username>
            <nif:friendToBeAdded>Michael_him_Friend_31498_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>